let filmsList1 = [
    "сериал благие знамения", 
    "The Last Belle’ by Neil Boyle", 
    "сериал хэппи", 
    "меню 2022", 
    "любовь смерть роботы", 
    "фильм притворство", 
    "на игле", 
    "бойцовский клуб", 
    "люси", 
    "билли эллиот 2000", 
    "из пепла 2003", 
    "девушка из дании", 
    "сериал пронзительно громко",
    "круэлла", 
    "человек против пчелы", 
    "морпехи 2005", 
    "the queen's gambit", 
    "очень долгие каникулы", 
    "орло,мальчик аллигатор", 
    "кэндиман", 
    "повелители хаоса(которых мы не досмотрели потому что полное говно)", 
    "гетто", 
    "Невероятные приключения Уоллеса и Громита: Дело о хлебе и смерти",
    "фантастические твари", 
    "американская история ужасов", 
    "труп невесты", 
    "лолита1997", 
    "полночная проповедь",
    "паранорман", 
    "ночь перед рождеством", 
    "The hоuse", 
    "неоновый демон", 
    "солнцестояние", 
    "реквием по мечте", 
    "драйв", 
    "франкенвинни", 
    "человеческий контракт", 
    "убей меня нежно", 
    "семейка адамс", 
    "тело дженифер", 
    "реинкарнация", 
    "убийство священного оленя", 
    "оно следует за тобой(вроде смотрели возможно)",
    "кровавый четверг", 
    "Où est Anne Frank!", 
    "козочек посмотрим", 
    "ая и ведьма", 
    "как я полюбила", 
    "Max 2002", 
    "русалка на суше 2020", 
    "изобретая Анну посмотрим", 
    "пцанок укр посмотрим", 
    "новый астрал", 
    "заклятие", 
    "американскую историю ужасов 5 часть", 
    "фильм антивирус 2012", 
    "Прах моей плоти словно огромная галактика", 
    "фильм искупление",
    "копы в юбках посмотрим", 
    "RealityKings - Raul Costa Wastes no Time & Quickly Undresses Roxy Risingstar", 
    "королевкая игра фильм", 
    "Фильм Багровый пик", 
    "Name: Anne with an E", 
    "фильм антивирус 2012", 
    "Мультик Илюзионист", 
    "фильм не отпускай", 
    "фильм моя ужасная подруга", 
    "Невероятный мир глазами энцо фильм", 
    "фильм котёл", 
    "дагон 2001", 
    "сериал орвил", 
    "золото партии фильм", 
    "фильм собачья жизнь часть 1", 
    "фильм большой 2016", 
    "игрушка для взрослых 2021", 
    "тебе стоит уйти 2020", 
    "доктор хаус", 
    "мадам 2017", 
    "фильм девушка за стеклом", 
    "мультфильм сальвадора дали дестино студия уолт дисней", 
    "клуб бунтарей", 
    "четыре хороших дня", 
    "полуночное евангелие", 
    "не оглядывайся", 
    "лучшее предложение", 
    "прислуга", 
    "семь психопатов 2012",
    "джек риччер", 
    "«Прерванная жизнь»", 
    "фильм глубина", 
    "дейв сделал лабиринт", 
    "спецназ города ангелов", 
    "ван хельсинг", 
    "страх и ненависть в ласвегасе", 
    "фильм амели", 
    "фильм зараженная", 
    "парень из пузыря", 
    "пост мортем 2022", 
    "Донни Дарко", 
    "Американский психопат", 
    "Таксист", 
    "Титан", 
    "С широко закрытыми глазами", 
    "ненависть", 
    "Падшие Ангелы", 
    "Чунгкингский Экспресс", 
    "трансфигурация 2021", 
    "похождения призрака", 
    "фильм шоколад", 
    "шоу трумана", 
    "нехочуха 1986", 
    "волк с уолл стрит", 
    "цветок пустыни", 
    "не отпускай меня", 
    "меняющие реальность 2015", 
    "харперы мультик", 
    "фильм окр окр 2017", 
    "ужастик the farm", 
    "мультфильм Ку! кин-дза-дза(2013)", 
    "валериан и город тысячи планет", 
    "Удивительные миры (нетфликс)", 
    "фильм идиокрация", 
    "безбрачная неделя", 
    "иди и смотри 1985", 
    "конструктор красного цвета 1993", 
    "забавные игры 1997", 
    "зелёный ад 2013", 
    "человек за солнцем 1988", 
    "подполье: покаяние 2007", 
    "груз 200 2007", 
    "комната 8", 
    "мультик плохие парни", 
    "сериал люцифер", 
    "геошторм", 
    "книжный магазин блека", 
    "ловец снов 2003", 
    "мой лучший любовник", 
    "мультик старый сапожник", 
    "легенда о пианисте", 
    "120 содом", 
    "заводной апельсин", 
    "на игле", 
    "реквием по мечте", 
    "дневник баскетболиста", 
    "мультик клаус", 
    "семь жизней", 
    "никто", 
    "мизери", 
    "мемуары гейши", 
    "плакса", 
    "типа копы", 
    "маленькие негодяи", 
    "терминал 2004", 
    "тебе стоит уйти 2020", 
    "портрет девушки в огне", 
    "монстры на каникулах", 
    "дом гуччи", 
    "население 436", 
    "капитан зум академия супер героев", 
    "на зов скорби", 
    "сериал йелоустоун", 
    "степфордские жёны",
    "тачки 2", 
    "милые кости", 
    "воспитывая хоуп", 
    "черный лебедь", 
    "достаточно близко", 
    "девушка подающая надежды", 
    "король статен айленда", 
    "воспоминания 2021", 
    "воспитанные волками", 
    "стилистка 2020", 
    "фильм короче", 
    "кладбище домашних животных",
    "белый воротник сериал", 
    "фильм окча 2017", 
    "рассеяный джованни", 
    "мультик арнольд",
    "навсикай из долины ветров",
    "дикая планета", 
    "заплати другому", 
    "фильм бабушка", 
    "век адалин", 
    "гнев человеческий", 
    "мультик амфибия",
    "как малые дети", 
    "демони сникет 33 несчастья", 
    "квартира джо 1996", 
    "я плюю на ваши могилы 1", 
    "красная королева сериал", 
    "фильм элвис пресли", 
    "пастушья кукла", 
    "спокойной ночи мамяока 2004", 
    "сноуден", 
    "заживо погребенный 1990", 
    "во все тяжкие", 
    "верной замок 2018", 
    "острые предметы", 
    "город эмбер побег", 
    "невидимка 2018", 
    "руины 2008", 
    "пряности и страсти", 
    "ужиться с самим собой", 
    "либо дьявол либо лифт дьявола 2010", 
    "Малкольм в центре внимания", 
    "сериал убивая евк", 
    "хроники спайдервика", 
    "идиократия", 
    "сверхлюдям запрещено исподьзовать свои силы", 
    "день курка 2019", 
    "сериал бестыжие", 
    "кошатьи миры луиса уэйна", 
    "навстречу шторму", 
    "дом на берегу залива 2021", 
    "сериал миротворец", 
    "сериал убивая евк", 
    "хроники спайдервика", 
    "идиократия", 
    "сверхлюдям запрещено исподьзовать свои силы", 
    "день курка 2019", 
    "сериал бестыжие", 
    "кошатьи миры луиса уэйна", 
    "навстречу шторму", 
    "дом на берегу залива 2021", 
    "сериал миротворец", 
    "рож мужской 2022", 
    "коллекционер 2", 
    "последняя женщина на земле", 
    "зачинщики фильм", 
    "фильм 1917", 
    "спасти рядового райна 1998", 
    "браться 2008", 
    "наши матери наши отцы 2012", 
    "мина 2016", 
    "джонни взял ружьё 1971", 
    "цельнометаллическая оболочка 1987", 
    "чистилище 1997", 
    "иди и смотри 1987", 
    "The Midnight Meat Train",
    "субурбикон", 
    "дикие истории 2014", 
    "преследование", 
    "тайны смолвиля", 
    "Сериал Mongrels", 
    "большой баг 2022", 
    "фильм вторая жизнь уве", 
    "фильм под водой", 
    "тачки 1",
    "сериал молокососы", 
    "химера 2018 фильм", 
    "Фильм: Великий Гетсби", 
    "книга жизни", 
    "место под соснами 2012",
];

let newArr = filmsList1;
if(localStorage.newArr) {
    newArr = localStorage.newArr.split(",");
}

let block = document.querySelector(".block");
let list = document.querySelector(".list");
let listLen, lenWithStyle;
let randomNum;
let button = document.querySelector(".button");
let del = document.querySelector(".del");
let copy = document.querySelector(".copy");
let leftoverMovies = document.querySelector(".leftover-movies");
if(localStorage.leftoverMovies) {
    leftoverMovies.innerHTML = Number(localStorage.leftoverMovies);
}

function createInterface(array) {
    for(let i = 0; i < array.length; i++) {
        let name = document.createElement("p");
        name.style.display = "flex";
        name.style.width = "310px";
        name.innerText = `${array[i]}`;
        list.append(name);
    }
}
createInterface(newArr);

    button.addEventListener("click", () => {
        button.style.backgroundSize = "80%";
        setTimeout(() => {button.style.backgroundSize = "100%";}, 300);
    
        block.style.display = "none";
        listLen = list.children.length;
        lenWithStyle = listLen * 350;
        randomNum = Math.floor(Math.random() * listLen) + 1;
        list.style.right = `${lenWithStyle - (randomNum * 350)}px`;
        leftoverMovies.innerHTML = `${listLen}`;
    });

    del.addEventListener("click", () => {
        if(block.style.display === "none") {
            del.style.background = "#ff8fe3";
            setTimeout(() => {del.style.background = ""}, 300);
    
            block.style.display = "flex";
            list.children[(lenWithStyle - (randomNum * 350)) / 350].remove();
            listLen = list.children.length;
            newArr = [];
            for(let i = 0; i < list.children.length; i++) {
                newArr.push(list.children[i].innerText);
            }
            leftoverMovies.innerHTML = `${listLen}`;
            saveState();
        } else {
            return
        }
    });

    
    // copy.addEventListener("click", () => {
    // });

function saveState() {
    localStorage.leftoverMovies = leftoverMovies.innerHTML = `${listLen}`;
    localStorage.newArr = newArr;
}